





# menu motion
ADMIN_BUTTON_MAIN_MENU="⬆️Main menu⬆️"
ADMIN_BUTTON_MAIN_ADMIN_MENU='🛠️Admin menu🛠️'
ADMIN_BUTTON_BACK_TO_MAIN_ADMIN_MENU='⬆️Admin menu⬆️'

# maim admin menu
ADMIN_BUTTON_ADDING_MENU= '✍️Adding menu✍️'
ADMIN_BUTTON_WORK_WITH_DB= '🗄Work with DB🗄'


ADMIN_BUTTON_UNBLOCK_USER = 'Разблокировать️'
ADMIN_BUTTON_DELETE_USER = 'Удалить️'

# adding buttons
ADMIN_BUTTON_ADD_WORD= '🔤Добавить слово'
ADMIN_BUTTON_ADD_MEDIA= '🏞️Добавить media'
ADMIN_BUTTON_ADD_TEST= '❓Добавить тест'
ADMIN_BUTTON_ADD_HOMEWORK= '🏠Добавить домашнее задание'
ADMIN_BUTTON_ADD_TASK= '📌Назначить задание'
ADMIN_BUTTON_ADD_TASK_SHEMA= '📌Назначить задание по схеме'
ADMIN_BUTTON_ADD_TASK_BY_SHEMA= '📌Назначить задание по схеме2'
ADMIN_BUTTON_ADD_TASK_MEDIA= '📌Назначить задание медиа(тест)'
ADMIN_BUTTON_ADD_GROUP= '👯️Создать группу пользователей'
# confirmation
ADMIN_BUTTON_CONFIRM_DATA="✅Все верно"
ADMIN_BUTTON_NO_CONFIRM_DATA="❌Сначала"

# adding menu welcomes
ADMIN_ADDING_MENU_WELCOME='Welcome to admin adding menu!'

# adding test

ADM_ADD_TEST_TEST = 'Выберите слово или введите его c клавиатуры:'
ADM_ADD_TEST_WORD_NOT_FIND = 'Слово не найдено, введите часть или выберите из найденных:'
ADM_ADD_TEST_DAY =  ('Выберите день изучения (или введите с клавиатуры) '
                      'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_TEST_DAY_REP =  ('Выберите день изучения (или введите с клавиатуры ЦИФРУ) '
                         'с учетом уже имеющихся в стандартной схеме изучения:')
ADM_ADD_TEST_TYPE = 'Выберите тип теста'
ADM_ADD_TEST_TYPE_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_TEST_CONFIRMATION = 'Проверьте и подтвердите запись в базу данных:'
ADM_ADD_TEST_CONFIRMATION_REP = 'Печатать не нужно. Пожалуйста, подтвердите или отмените:'
ADM_ADD_TEST_ERROR = 'Ошибка при записи в базу данных, обратитесь к администратору'
ADM_ADD_TEST_ADDED = 'Тест для слова {} (тип {}) добавлено в базу данных.'
ADM_ADD_TEST_WORD_AGAIN = 'Создаем тест заново, выбирайте слово или напечатайте его или его часть:'

ADM_CONFIRM='✅CONFIRM✅'
